OdDAI.WhereRule.parentItem
\details
Retrieves a parent item of the Where Rule instance.
\returns A raw pointer to selection of NamedType or GlobalRule.

OdDAI.WhereRule.getAST
\details
Retrieves the expression of the Where-Rule constraint, represented as a set of tokens.
\returns A raw pointer to a set of tokens, which represent the expression of the Where-Rule object.

OdDAI.WhereRule.expression
\details
Retrieves the expression of the Where-Rule constraint.
\returns An ANSI string that contains the expression of the Where-Rule object.

OdDAI.WhereRule.label
\details
Retrieves the Where Rule label.
\returns An ANSI string that contains the label text.

OdDAI.WhereRule.Dispose
\details
Destroys the Where-Rule object.

OdDAI.WhereRule
\details
A class that implements a Where-Rule constraint for instance validation purposes.